src/InformationRegisters/АпиЭ_СоответствиеЗначенийРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>АпиЭ_СоответствиеЗначенийРеквизитов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СсылкаНаЗначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаСвойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>FeatureName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FeatureUom</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>FeatureCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>FeatureValue</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/РС_Сервер/Ext/Module.bsl
// Заполняет РегистрСведений.АпиЭ_СоответствиеЗначенийРеквизитов 
// найденными реквизитами и их значениями при разборе XML 
// чтобы можно было сопоставить их со значениями в базе
//
//
// Параметры:
//  FeatureETIMDetails  - ОбъектXDTO - Содержит реквизиты номенклатуры для добавления в регистр
//                 
Процедура ДобавитьРеквизитыНоменклатурыРС(FeatureETIMDetails)

	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АпиЭ_СоответствиеЗначенийРеквизитов.СсылкаНаСвойство КАК СсылкаНаСвойство,
		|	АпиЭ_СоответствиеЗначенийРеквизитов.СсылкаНаЗначение КАК СсылкаНаЗначение
		|ИЗ
		|	РегистрСведений.АпиЭ_СоответствиеЗначенийРеквизитов КАК АпиЭ_СоответствиеЗначенийРеквизитов
		|ГДЕ
		|	АпиЭ_СоответствиеЗначенийРеквизитов.FeatureCode = ""EF001792""
		|	И АпиЭ_СоответствиеЗначенийРеквизитов.FeatureValue = ""3""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	

КонецПроцедуры // ДобавитьРеквизитНоменклатурыРС()
